Revit 2027 API
TableSectionData.SetCellParamIdAndCategoryId(Int32, ElementId, ElementId) Method
 Sets a column's category and parameter Id
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCellParamIdAndCategoryId(
	int nCol,
	ElementId paramId,
	ElementId categoryId
)
Public Sub SetCellParamIdAndCategoryId (
	nCol As Integer,
	paramId As ElementId,
	categoryId As ElementId
)
public:
void SetCellParamIdAndCategoryId(
	int nCol,
	ElementId^ paramId,
	ElementId^ categoryId
)
member SetCellParamIdAndCategoryId :
        nCol : int *
        paramId : ElementId *
        categoryId : ElementId -> unit
Parameters
nCol Int32
paramId ElementId
categoryId ElementId
Exceptions
Exception | Condition
ArgumentException |  The given column number nCol is invalid. -or- The paramId or categoryId is not acceptable.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This operation is forbidden for cells in standard schedule body sections.
See Also
Reference
TableSectionData Class
SetCellParamIdAndCategoryId Overload
Autodesk.Revit.DB Namespace